self/case4/pimple_poly/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters .01;

vertices
(
    (0 0 0) // 0
    (75 0 0) // 1
    (175 0 0) // 2
    (0 15 0) // 3
    (75 15 0) // 4
    (175 15 0) // 5
    (0 0 .1) // 6
    (75 0 .1) // 7
    (175 0 .1) // 8
    (0 15 .1) // 9
    (75 15 .1) // 10
    (175 15 .1) // 11
);

blocks
(
    hex (0 1 4 3 6 7 10 9) (60 50 1) simpleGrading (1 1 1)
    hex (1 2 5 4 7 8 11 10) (60 50 1) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
);

edges
(
  polyLine 1 2
  (
    (105 10 0)
    (130 20 0)
    (148 12 0)
  )
  
  polyLine 7 8
  (
    (105 10 0.1)
    (130 20 0.1)
    (148 12 0.1)
  )
  
  polyLine 4 5
  (
    (105 25 0)
    (130 35 0)
    (148 27 0)
  )
  
  polyLine 10 11
  (
    (105 25 0.1)
    (130 35 0.1)
    (148 27 0.1)
  )
  
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
	    (0 3 9 6)
        );
    }
    outlet
    {
        type patch;
        faces
        (
	    (2 5 11 8)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 7 6)
            (1 2 8 7)
	    (3 4 10 9)
	    (4 5 11 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
